import time
import telebot
import random

r = random.randint(1,50)
bot = telebot.TeleBot('7659043896:AAElYsiYcdI-_GJaNPV-jcri5nCK74UH4T4') #!!!!!чтобы проверить, пожалуйста, не испоьзуйте этот токен, так как он рабочий, настроен на бота для проекта, создайте своего бота в бот фазер
@bot.message_handler()
def word(message):
    global r
    if r > 0:
        r -= 1
        word1 = {
            'А': ['арбуз', 'ананас'],
            'Б': ['борщ', 'береза'],
            'В': ['вода', 'ветер'],
            'Г': ['газета', 'голова'],
            'Д': ['дерево', 'дверь'],
            'Е': ['ель', 'этаж'],
            'Ё': ['ёлка', 'ёжик'],
            'Ж': ['желудь', 'жираф'],
            'З': ['зебра', 'звезда'],
            'И': ['игла', 'игра'],
            'Й': ['йога', 'йод'],
            'К': ['кошка', 'комната'],
            'Л': ['лампа', 'лес'],
            'М': ['морковь', 'машина'],
            'Н': ['нос', 'нога'],
            'О': ['океан', 'облако'],
            'П': ['пирог', 'письмо'],
            'Р': ['река', 'рисунок'],
            'С': ['солнце', 'сад'],
            'Т': ['телефон', 'тарелка'],
            'У': ['утка', 'улица'],
            'Ф': ['фонтан', 'фильм'],
            'Х': ['халат', 'хлеб'],
            'Ц': ['цветок', 'центр'],
            'Ч': ['чай', 'человек'],
            'Ш': ['школа', 'шарф'],
            'Щ': ['щука', 'щепка'],
            'Ъ': [],
            'Ы': ['ысь'],
            'Ь': [],
            'Э': ['экран', 'экономика'],
            'Ю': ['юбка', 'ювелир'],
            'Я': ['яблоко', 'ягода']
        }
        a = message.text.upper()[len(message.text.upper())-1]
        w = ["word1","word2","word3","word4","word5"]
        с = random.choice(w)
        b = word1[a]
        time.sleep(random.randint(0,5))
        bot.send_message(message.chat.id,word1[a])
    else:
        bot.send_message(message.chat.id,'У меня закончились варианы, поздравляю с победой!')
